unicab369/ch32mess/ch32fun/ch57xhw.h
#if MCU_PACKAGE == 1 || MCU_PACKAGE == 3 // CH571/3
/* GPIO alias name */
#define  bAIN0     (1<<4)   // PA4
#define  bRXD3     (1<<4)   // PA4
#define  bAIN1     (1<<5)   // PA5
#define  bTXD3     (1<<5)   // PA5
#define  bAIN12    (1<<8)   // PA8
#define  bRXD1     (1<<8)   // PA8
#define  bAIN13    (1<<9)   // PA9
#define  bTMR0     (1<<9)   // PA9
#define  bCAP0     bTMR0
#define  bPWM0     bTMR0
#define  bTXD1     (1<<9)   // PA9
#define  bX32KI    (1<<10)  // PA10
#define  bTMR1     (1<<10)  // PA10
#define  bCAP1     bTMR1
#define  bPWM1     bTMR1
#define  bX32KO    (1<<11)  // PA11
#define  bTMR2     (1<<11)  // PA11
#define  bCAP2     bTMR2
#define  bPWM2     bTMR2
#define  bAIN2     (1<<12)  // PA12
#define  bPWM4     (1<<12)  // PA12
#define  bSCS      (1<<12)  // PA12
#define  bAIN3     (1<<13)  // PA13
#define  bSCK0     (1<<13)  // PA13
#define  bPWM5     (1<<13)  // PA13
#define  bAIN4     (1<<14)  // PA14
#define  bMOSI     (1<<14)  // PA14
#define  bTXD0_    (1<<14)  // PA14
#define  bAIN5     (1<<15)  // PA15
#define  bMISO     (1<<15)  // PA15
#define  bRXD0_    (1<<15)  // PA15
#define  bAIN8     (1<<0)   // PB0
#define  bPWM6     (1<<0)   // PB0
#define  bCTS      (1<<0)   // PB0
#define  bPWM7     (1<<4)   // PB4
#define  bRXD0     (1<<4)   // PB4
#define  bAIN9     (1<<6)   // PB6
#define  bRTS      (1<<6)   // PB6
#define  bPWM8     (1<<6)   // PB6
#define  bTXD0     (1<<7)   // PB7
#define  bPWM9     (1<<7)   // PB7
#define  bUDM      (1<<10)  // PB10
#define  bTMR1_    (1<<10)  // PB10
#define  bCAP1_    bTMR1_
#define  bPWM1_    bTMR1_
#define  bUDP      (1<<11)  // PB11
#define  bTMR2_    (1<<11)  // PB11
#define  bCAP2_    bTMR2_
#define  bPWM2_    bTMR2_
#define  bSCS_     (1<<12)  // PB12
#define  bRXD1_    (1<<12)  // PB12
#define  bSCK0_    (1<<13)  // PB13
#define  bTXD1_    (1<<13)  // PB13
#define  bTIO      (1<<14)  // PB14
#define  bDSR      (1<<14)  // PB14
#define  bMOSI_    (1<<14)  // PB14
#define  bPWM10    (1<<14)  // PB14
#define  bTCK      (1<<15)  // PB15
#define  bMISO_    (1<<15)  // PB15
#define  bDTR      (1<<15)  // PB15
#define  bRXD2     (1<<22)  // PB22
#define  bTMR3     (1<<22)  // PB22
#define  bCAP3     bTMR3
#define  bPWM3     bTMR3
#define  bRST      (1<<23)  // PB23
#define  bTMR0_    (1<<23)  // PB23
#define  bCAP0_    bTMR0_
#define  bPWM0_    bTMR0_
#define  bTXD2     (1<<23)  // PB23
#define  bPWM11    (1<<23)  // PB23
#else
/* GPIO alias name */
#define bTIO       (1<<0)   //PA0
#define bTXD_3     (1<<0)   //PA0
#define bRXD_2     (1<<0)   //PA0
#define bSCL_1     (1<<0)   //PA0
#define bUDM       (1<<0)   //PA0
#define bTCK       (1<<1)   //PA1
#define bTXD_2     (1<<1)   //PA1
#define bRXD_3     (1<<1)   //PA1
#define bSDA_1     (1<<1)   //PA1
#define bUDP       (1<<1)   //PA1
#define bTXD_1     (1<<2)   //PA2
#define bRXD_0     (1<<2)   //PA2
#define bSDA_2     (1<<2)   //PA2
#define bPWM2      (1<<2)   //PA2    
#define bPWM0_1    (1<<2)   //PA2    
#define bCAP1_1    (1<<2)   //PA2
#define bCAP2_0    (1<<2)   //PA2
#define bSCS_      (1<<2)   //PA2
#define bKEY0      (1<<2)   //PA2
#define bCMP0      (1<<2)   //PA2
#define bTXD_0     (1<<3)   //PA3
#define bRXD_1     (1<<3)   //PA3
#define bSCL_2     (1<<3)   //PA3
#define bPWM3      (1<<3)   //PA3    
#define bSCK_      (1<<3)   //PA3
#define bKEY1      (1<<3)   //PA3
#define bCMP1      (1<<3)   //PA3
#define bPWM4      (1<<4)   //PA4    
#define bPWM0_2    (1<<4)   //PA4    
#define bSCS       (1<<4)   //PA4
#define bCAP1_2    (1<<4)   //PA4
#define bCAP2_3    (1<<4)   //PA4
#define bXM25MO    (1<<4)   //PA4
#define bSCL_3     (1<<5)   //PA5
#define bSCK       (1<<5)   //PA5
#define bSDA_6     (1<<6)   //PA6
#define bMISO      (1<<6)   //PA6
#define bRXD_4     (1<<6)   //PA6
#define bTXD_4     (1<<7)   //PA7
#define bMOSI      (1<<7)   //PA7
#define bPWM1      (1<<7)   //PA7    
#define bPWM0_0    (1<<7)   //PA7    
#define bRST_      (1<<7)   //PA7
#define bCAP1_0    (1<<7)   //PA7
#define bCAP2_1    (1<<7)   //PA7
#define bCMP2      (1<<7)   //PA7
#define bRST       (1<<8)   //PA8
#define bTXD_5     (1<<8)   //PA8
#define bSCL_0     (1<<8)   //PA8
#define bPWM5      (1<<8)   //PA8    
#define bKEY2      (1<<8)   //PA8
#define bSDA_0     (1<<9)   //PA9
#define bPWM0_3    (1<<9)   //PA9    
#define bRXD_5     (1<<9)   //PA9
#define bCAP1_3    (1<<9)   //PA9
#define bCAP2_2    (1<<9)   //PA9
#define bTXD_7     (1<<10)  //PA10
#define bRXD_6     (1<<10)  //PA10
#define bKEY3      (1<<10)  //PA10
#define bTXD_6     (1<<11)  //PA11
#define bRXD_7     (1<<11)  //PA11
#define bKEY4      (1<<11)  //PA11
#endif

#if MCU_PACKAGE == 1 || MCU_PACKAGE == 3 // CH571/3
/* Timer0 register */
#define R32_TMR0_CONTROL    (*((vu32*)0x40002000)) // RW, TMR0 control
#define R8_TMR0_CTRL_MOD    (*((vu8*)0x40002000))  // RW, TMR0 mode control
#define R8_TMR0_INTER_EN    (*((vu8*)0x40002002))  // RW, TMR0 interrupt enable
#define R32_TMR0_STATUS     (*((vu32*)0x40002004)) // RW, TMR0 status
#define R8_TMR0_INT_FLAG    (*((vu8*)0x40002006))  // RW1, TMR0 interrupt flag
#define R8_TMR0_FIFO_COUNT  (*((vu8*)0x40002007))  // RO, TMR0 FIFO count status
#define R32_TMR0_COUNT      (*((vu32*)0x40002008)) // RO, TMR0 current count
#define R16_TMR0_COUNT      (*((vu16*)0x40002008)) // RO, TMR0 current count
#define R8_TMR0_COUNT       (*((vu8*)0x40002008))  // RO, TMR0 current count
#define R32_TMR0_CNT_END    (*((vu32*)0x4000200C)) // RW, TMR0 end count value, only low 26 bit
#define R32_TMR0_FIFO       (*((vu32*)0x40002010)) // RO/WO, TMR0 FIFO register, only low 26 bit
#define R16_TMR0_FIFO       (*((vu16*)0x40002010)) // RO/WO, TMR0 FIFO register
#define R8_TMR0_FIFO        (*((vu8*)0x40002010))  // RO/WO, TMR0 FIFO register

/* Timer1 register */
#define R32_TMR1_CONTROL    (*((vu32*)0x40002400)) // RW, TMR1 control
#define R8_TMR1_CTRL_MOD    (*((vu8*)0x40002400))  // RW, TMR1 mode control
#define R8_TMR1_CTRL_DMA    (*((vu8*)0x40002401))  // RW, TMR1 DMA control
#define R8_TMR1_INTER_EN    (*((vu8*)0x40002402))  // RW, TMR1 interrupt enable
#define R32_TMR1_STATUS     (*((vu32*)0x40002404)) // RW, TMR1 status
#define R8_TMR1_INT_FLAG    (*((vu8*)0x40002406))  // RW1, TMR1 interrupt flag
#define R8_TMR1_FIFO_COUNT  (*((vu8*)0x40002407))  // RO, TMR1 FIFO count status
#define R32_TMR1_COUNT      (*((vu32*)0x40002408)) // RO, TMR1 current count
#define R16_TMR1_COUNT      (*((vu16*)0x40002408)) // RO, TMR1 current count
#define R8_TMR1_COUNT       (*((vu8*)0x40002408))  // RO, TMR1 current count
#define R32_TMR1_CNT_END    (*((vu32*)0x4000240C)) // RW, TMR1 end count value, only low 26 bit
#define R32_TMR1_FIFO       (*((vu32*)0x40002410)) // RO/WO, TMR1 FIFO register, only low 26 bit
#define R16_TMR1_FIFO       (*((vu16*)0x40002410)) // RO/WO, TMR1 FIFO register
#define R8_TMR1_FIFO        (*((vu8*)0x40002410))  // RO/WO, TMR1 FIFO register
#define R32_TMR1_DMA_NOW    (*((vu32*)0x40002414)) // RW, TMR1 DMA current address
#define R16_TMR1_DMA_NOW    (*((vu16*)0x40002414)) // RW, TMR1 DMA current address
#define R32_TMR1_DMA_BEG    (*((vu32*)0x40002418)) // RW, TMR1 DMA begin address
#define R16_TMR1_DMA_BEG    (*((vu16*)0x40002418)) // RW, TMR1 DMA begin address
#define R32_TMR1_DMA_END    (*((vu32*)0x4000241C)) // RW, TMR1 DMA end address
#define R16_TMR1_DMA_END    (*((vu16*)0x4000241C)) // RW, TMR1 DMA end address

/* Timer2 register */
#define R32_TMR2_CONTROL    (*((vu32*)0x40002800)) // RW, TMR2 control
#define R8_TMR2_CTRL_MOD    (*((vu8*)0x40002800))  // RW, TMR2 mode control
#define R8_TMR2_CTRL_DMA    (*((vu8*)0x40002801))  // RW, TMR2 DMA control
#define R8_TMR2_INTER_EN    (*((vu8*)0x40002802))  // RW, TMR2 interrupt enable
#define R32_TMR2_STATUS     (*((vu32*)0x40002804)) // RW, TMR2 status
#define R8_TMR2_INT_FLAG    (*((vu8*)0x40002806))  // RW1, TMR2 interrupt flag
#define R8_TMR2_FIFO_COUNT  (*((vu8*)0x40002807))  // RO, TMR2 FIFO count status
#define R32_TMR2_COUNT      (*((vu32*)0x40002808)) // RO, TMR2 current count
#define R16_TMR2_COUNT      (*((vu16*)0x40002808)) // RO, TMR2 current count
#define R8_TMR2_COUNT       (*((vu8*)0x40002808))  // RO, TMR2 current count
#define R32_TMR2_CNT_END    (*((vu32*)0x4000280C)) // RW, TMR2 end count value, only low 26 bit
#define R32_TMR2_FIFO       (*((vu32*)0x40002810)) // RO/WO, TMR2 FIFO register, only low 26 bit
#define R16_TMR2_FIFO       (*((vu16*)0x40002810)) // RO/WO, TMR2 FIFO register
#define R8_TMR2_FIFO        (*((vu8*)0x40002810))  // RO/WO, TMR2 FIFO register
#define R32_TMR2_DMA_NOW    (*((vu32*)0x40002814)) // RW, TMR2 DMA current address
#define R16_TMR2_DMA_NOW    (*((vu16*)0x40002814)) // RW, TMR2 DMA current address
#define R32_TMR2_DMA_BEG    (*((vu32*)0x40002818)) // RW, TMR2 DMA begin address
#define R16_TMR2_DMA_BEG    (*((vu16*)0x40002818)) // RW, TMR2 DMA begin address
#define R32_TMR2_DMA_END    (*((vu32*)0x4000281C)) // RW, TMR2 DMA end address
#define R16_TMR2_DMA_END    (*((vu16*)0x4000281C)) // RW, TMR2 DMA end address

/* Timer3 register */
#define R32_TMR3_CONTROL    (*((vu32*)0x40002C00)) // RW, TMR3 control
#define R8_TMR3_CTRL_MOD    (*((vu8*)0x40002C00))  // RW, TMR3 mode control
#define R8_TMR3_INTER_EN    (*((vu8*)0x40002C02))  // RW, TMR3 interrupt enable
#define R32_TMR3_STATUS     (*((vu32*)0x40002C04)) // RW, TMR3 status
#define R8_TMR3_INT_FLAG    (*((vu8*)0x40002C06))  // RW1, TMR3 interrupt flag
#define R8_TMR3_FIFO_COUNT  (*((vu8*)0x40002C07))  // RO, TMR3 FIFO count status
#define R32_TMR3_COUNT      (*((vu32*)0x40002C08)) // RO, TMR3 current count
#define R16_TMR3_COUNT      (*((vu16*)0x40002C08)) // RO, TMR3 current count
#define R8_TMR3_COUNT       (*((vu8*)0x40002C08))  // RO, TMR3 current count
#define R32_TMR3_CNT_END    (*((vu32*)0x40002C0C)) // RW, TMR3 end count value, only low 26 bit
#define R32_TMR3_FIFO       (*((vu32*)0x40002C10)) // RO/WO, TMR3 FIFO register, only low 26 bit
#define R16_TMR3_FIFO       (*((vu16*)0x40002C10)) // RO/WO, TMR3 FIFO register
#define R8_TMR3_FIFO        (*((vu8*)0x40002C10))  // RO/WO, TMR3 FIFO register

